Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_dsihost.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM7_dsihost equates.
 */

#pragma once

#include    <stdint.h>

// DSIHOST address definitions
// ---------------------------

typedef struct {
    volatile    uint32_t    DSI_VR;
    volatile    uint32_t    DSI_CR;
    volatile    uint32_t    DSI_CCR;
    volatile    uint32_t    DSI_LVCIDR;
    volatile    uint32_t    DSI_LCOLCR;
    volatile    uint32_t    DSI_LPCR;
    volatile    uint32_t    DSI_LPMCR;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    DSI_PCR;
    volatile    uint32_t    DSI_GVCIDR;
    volatile    uint32_t    DSI_MCR;
    volatile    uint32_t    DSI_VMCR;
    volatile    uint32_t    DSI_VPCR;
    volatile    uint32_t    DSI_VCCR;
    volatile    uint32_t    DSI_VNPCR;
    volatile    uint32_t    DSI_VHSACR;
    volatile    uint32_t    DSI_VHBPCR;
    volatile    uint32_t    DSI_VLCR;
    volatile    uint32_t    DSI_VVSACR;
    volatile    uint32_t    DSI_VVBPCR;
    volatile    uint32_t    DSI_VVFPCR;
    volatile    uint32_t    DSI_VVACR;
    volatile    uint32_t    DSI_LCCR;
    volatile    uint32_t    DSI_CMCR;
    volatile    uint32_t    DSI_GHCR;
    volatile    uint32_t    DSI_GPDR;
    volatile    uint32_t    DSI_GPSR;
    volatile    uint32_t    DSI_TCCR0;
    volatile    uint32_t    DSI_TCCR1;
    volatile    uint32_t    DSI_TCCR2;
    volatile    uint32_t    DSI_TCCR3;
    volatile    uint32_t    DSI_TCCR4;
    volatile    uint32_t    DSI_TCCR5;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    DSI_CLCR;
    volatile    uint32_t    DSI_CLTCR;
    volatile    uint32_t    DSI_DLTCR;
    volatile    uint32_t    DSI_PCTLR;
    volatile    uint32_t    DSI_PCONFR;
    volatile    uint32_t    DSI_PUCR;
    volatile    uint32_t    DSI_PTTCR;
    volatile    uint32_t    DSI_PSR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    DSI_ISR0;
    volatile    uint32_t    DSI_ISR1;
    volatile    uint32_t    DSI_IER0;
    volatile    uint32_t    DSI_IER1;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    DSI_FIR0;
    volatile    uint32_t    DSI_FIR1;
    volatile    uint32_t    RESERVED4[8];
    volatile    uint32_t    DSI_VSCR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    DSI_LCVCIDR;
    volatile    uint32_t    DSI_LCCCR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    DSI_LPMCCR;
    volatile    uint32_t    RESERVED7[7];
    volatile    uint32_t    DSI_VMCCR;
    volatile    uint32_t    DSI_VPCCR;
    volatile    uint32_t    DSI_VCCCR;
    volatile    uint32_t    DSI_VNPCCR;
    volatile    uint32_t    DSI_VHSACCR;
    volatile    uint32_t    DSI_VHBPCCR;
    volatile    uint32_t    DSI_VLCCR;
    volatile    uint32_t    DSI_VVSACCR;
    volatile    uint32_t    DSI_VVBPCCR;
    volatile    uint32_t    DSI_VVFPCCR;
    volatile    uint32_t    DSI_VVACCR;
    volatile    uint32_t    RESERVED8[167];
    volatile    uint32_t    DSI_WCFGR;
    volatile    uint32_t    DSI_WCR;
    volatile    uint32_t    DSI_WIER;
    volatile    uint32_t    DSI_WISR;
    volatile    uint32_t    DSI_WIFCR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    DSI_WPCR0;
    volatile    uint32_t    DSI_WPCR1;
    volatile    uint32_t    DSI_WPCR2;
    volatile    uint32_t    DSI_WPCR3;
    volatile    uint32_t    DSI_WPCR4;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    DSI_WRPCR;
} DSIHOST_TypeDef;

#ifdef __cplusplus
#define DSIHOST reinterpret_cast<DSIHOST_TypeDef *>(0x50000000U)

#else
#define DSIHOST ((DSIHOST_TypeDef *)0x50000000U)
#endif

// DSI_VR Configuration

#define DSIHOST_DSI_VR_VERSION          (0xFFFFFFFFU<<0U)
#define DSIHOST_DSI_VR_VERSION_0        (0x1U<<0U)

// DSI_CR Configuration

#define DSIHOST_DSI_CR_EN               (0x1U<<0U)

// DSI_CCR Configuration

#define DSIHOST_DSI_CCR_TOCKDIV         (0xFFU<<8U)
#define DSIHOST_DSI_CCR_TOCKDIV_0       (0x1U<<8U)
#define DSIHOST_DSI_CCR_TXECKDIV        (0xFFU<<0U)
#define DSIHOST_DSI_CCR_TXECKDIV_0      (0x1U<<0U)

// DSI_LVCIDR Configuration

#define DSIHOST_DSI_LVCIDR_VCID         (0x3U<<0U)
#define DSIHOST_DSI_LVCIDR_VCID_0       (0x1U<<0U)

// DSI_LCOLCR Configuration

#define DSIHOST_DSI_LCOLCR_LPE          (0x1U<<8U)
#define DSIHOST_DSI_LCOLCR_COLC         (0xFU<<0U)
#define DSIHOST_DSI_LCOLCR_COLC_0       (0x1U<<0U)

// DSI_LPCR Configuration

#define DSIHOST_DSI_LPCR_HSP            (0x1U<<2U)
#define DSIHOST_DSI_LPCR_VSP            (0x1U<<1U)
#define DSIHOST_DSI_LPCR_DEP            (0x1U<<0U)

// DSI_LPMCR Configuration

#define DSIHOST_DSI_LPMCR_LPSIZE        (0xFFU<<16U)
#define DSIHOST_DSI_LPMCR_LPSIZE_0      (0x1U<<16U)
#define DSIHOST_DSI_LPMCR_VLPSIZE       (0xFFU<<0U)
#define DSIHOST_DSI_LPMCR_VLPSIZE_0     (0x1U<<0U)

// DSI_PCR Configuration

#define DSIHOST_DSI_PCR_CRCRXE          (0x1U<<4U)
#define DSIHOST_DSI_PCR_ECCRXE          (0x1U<<3U)
#define DSIHOST_DSI_PCR_BTAE            (0x1U<<2U)
#define DSIHOST_DSI_PCR_ETRXE           (0x1U<<1U)
#define DSIHOST_DSI_PCR_ETTXE           (0x1U<<0U)

// DSI_GVCIDR Configuration

#define DSIHOST_DSI_GVCIDR_VCID         (0x3U<<0U)
#define DSIHOST_DSI_GVCIDR_VCID_0       (0x1U<<0U)

// DSI_MCR Configuration

#define DSIHOST_DSI_MCR_CMDM            (0x1U<<0U)

// DSI_VMCR Configuration

#define DSIHOST_DSI_VMCR_PGO            (0x1U<<24U)
#define DSIHOST_DSI_VMCR_PGM            (0x1U<<20U)
#define DSIHOST_DSI_VMCR_PGE            (0x1U<<16U)
#define DSIHOST_DSI_VMCR_LPCE           (0x1U<<15U)
#define DSIHOST_DSI_VMCR_FBTAAE         (0x1U<<14U)
#define DSIHOST_DSI_VMCR_LPHFPE         (0x1U<<13U)
#define DSIHOST_DSI_VMCR_LPHBPE         (0x1U<<12U)
#define DSIHOST_DSI_VMCR_LPVAE          (0x1U<<11U)
#define DSIHOST_DSI_VMCR_LPVFPE         (0x1U<<10U)
#define DSIHOST_DSI_VMCR_LPVBPE         (0x1U<<9U)
#define DSIHOST_DSI_VMCR_LPVSAE         (0x1U<<8U)
#define DSIHOST_DSI_VMCR_VMT            (0x3U<<0U)
#define DSIHOST_DSI_VMCR_VMT_0          (0x1U<<0U)

// DSI_VPCR Configuration

