Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_dsihost.h
#define DSIHOST_DSI_VPCR_VPSIZE         (0x3FFFU<<0U)
#define DSIHOST_DSI_VPCR_VPSIZE_0       (0x1U<<0U)

// DSI_VCCR Configuration

#define DSIHOST_DSI_VCCR_NUMC           (0x1FFFU<<0U)
#define DSIHOST_DSI_VCCR_NUMC_0         (0x1U<<0U)

// DSI_VNPCR Configuration

#define DSIHOST_DSI_VNPCR_NPSIZE        (0x1FFFU<<0U)
#define DSIHOST_DSI_VNPCR_NPSIZE_0      (0x1U<<0U)

// DSI_VHSACR Configuration

#define DSIHOST_DSI_VHSACR_HSA          (0xFFFU<<0U)
#define DSIHOST_DSI_VHSACR_HSA_0        (0x1U<<0U)

// DSI_VHBPCR Configuration

#define DSIHOST_DSI_VHBPCR_HBP          (0xFFFU<<0U)
#define DSIHOST_DSI_VHBPCR_HBP_0        (0x1U<<0U)

// DSI_VLCR Configuration

#define DSIHOST_DSI_VLCR_HLINE          (0x7FFFU<<0U)
#define DSIHOST_DSI_VLCR_HLINE_0        (0x1U<<0U)

// DSI_VVSACR Configuration

#define DSIHOST_DSI_VVSACR_VSA          (0x3FFU<<0U)
#define DSIHOST_DSI_VVSACR_VSA_0        (0x1U<<0U)

// DSI_VVBPCR Configuration

#define DSIHOST_DSI_VVBPCR_VBP          (0x3FFU<<0U)
#define DSIHOST_DSI_VVBPCR_VBP_0        (0x1U<<0U)

// DSI_VVFPCR Configuration

#define DSIHOST_DSI_VVFPCR_VFP          (0x3FFU<<0U)
#define DSIHOST_DSI_VVFPCR_VFP_0        (0x1U<<0U)

// DSI_VVACR Configuration

#define DSIHOST_DSI_VVACR_VA            (0x3FFFU<<0U)
#define DSIHOST_DSI_VVACR_VA_0          (0x1U<<0U)

// DSI_LCCR Configuration

#define DSIHOST_DSI_LCCR_CMDSIZE        (0xFFFFU<<0U)
#define DSIHOST_DSI_LCCR_CMDSIZE_0      (0x1U<<0U)

// DSI_CMCR Configuration

#define DSIHOST_DSI_CMCR_MRDPS          (0x1U<<24U)
#define DSIHOST_DSI_CMCR_DLWTX          (0x1U<<19U)
#define DSIHOST_DSI_CMCR_DSR0TX         (0x1U<<18U)
#define DSIHOST_DSI_CMCR_DSW1TX         (0x1U<<17U)
#define DSIHOST_DSI_CMCR_DSW0TX         (0x1U<<16U)
#define DSIHOST_DSI_CMCR_GLWTX          (0x1U<<14U)
#define DSIHOST_DSI_CMCR_GSR2TX         (0x1U<<13U)
#define DSIHOST_DSI_CMCR_GSR1TX         (0x1U<<12U)
#define DSIHOST_DSI_CMCR_GSR0TX         (0x1U<<11U)
#define DSIHOST_DSI_CMCR_GSW2TX         (0x1U<<10U)
#define DSIHOST_DSI_CMCR_GSW1TX         (0x1U<<9U)
#define DSIHOST_DSI_CMCR_GSW0TX         (0x1U<<8U)
#define DSIHOST_DSI_CMCR_ARE            (0x1U<<1U)
#define DSIHOST_DSI_CMCR_TEARE          (0x1U<<0U)

// DSI_GHCR Configuration

#define DSIHOST_DSI_GHCR_WCMSB          (0xFFU<<16U)
#define DSIHOST_DSI_GHCR_WCMSB_0        (0x1U<<16U)
#define DSIHOST_DSI_GHCR_WCLSB          (0xFFU<<8U)
#define DSIHOST_DSI_GHCR_WCLSB_0        (0x1U<<8U)
#define DSIHOST_DSI_GHCR_VCID           (0x3U<<6U)
#define DSIHOST_DSI_GHCR_VCID_0         (0x1U<<6U)
#define DSIHOST_DSI_GHCR_DT             (0x3FU<<0U)
#define DSIHOST_DSI_GHCR_DT_0           (0x1U<<0U)

// DSI_GPDR Configuration

#define DSIHOST_DSI_GPDR_DATA4          (0xFFU<<24U)
#define DSIHOST_DSI_GPDR_DATA4_0        (0x1U<<24U)
#define DSIHOST_DSI_GPDR_DATA3          (0xFFU<<16U)
#define DSIHOST_DSI_GPDR_DATA3_0        (0x1U<<16U)
#define DSIHOST_DSI_GPDR_DATA2          (0xFFU<<8U)
#define DSIHOST_DSI_GPDR_DATA2_0        (0x1U<<8U)
#define DSIHOST_DSI_GPDR_DATA1          (0xFFU<<0U)
#define DSIHOST_DSI_GPDR_DATA1_0        (0x1U<<0U)

// DSI_GPSR Configuration

#define DSIHOST_DSI_GPSR_RCB            (0x1U<<6U)
#define DSIHOST_DSI_GPSR_PRDFF          (0x1U<<5U)
#define DSIHOST_DSI_GPSR_PRDFE          (0x1U<<4U)
#define DSIHOST_DSI_GPSR_PWRFF          (0x1U<<3U)
#define DSIHOST_DSI_GPSR_PWRFE          (0x1U<<2U)
#define DSIHOST_DSI_GPSR_CMDFF          (0x1U<<1U)
#define DSIHOST_DSI_GPSR_CMDFE          (0x1U<<0U)

// DSI_TCCR0 Configuration

#define DSIHOST_DSI_TCCR0_HSTX_TOCNT    (0xFFFFU<<16U)
#define DSIHOST_DSI_TCCR0_HSTX_TOCNT_0  (0x1U<<16U)
#define DSIHOST_DSI_TCCR0_LPRX_TOCNT    (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR0_LPRX_TOCNT_0  (0x1U<<0U)

// DSI_TCCR1 Configuration

#define DSIHOST_DSI_TCCR1_HSRD_TOCNT    (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR1_HSRD_TOCNT_0  (0x1U<<0U)

// DSI_TCCR2 Configuration

#define DSIHOST_DSI_TCCR2_LPRD_TOCNT    (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR2_LPRD_TOCNT_0  (0x1U<<0U)

// DSI_TCCR3 Configuration

#define DSIHOST_DSI_TCCR3_PM            (0x1U<<24U)
#define DSIHOST_DSI_TCCR3_HSWR_TOCNT    (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR3_HSWR_TOCNT_0  (0x1U<<0U)

// DSI_TCCR4 Configuration

#define DSIHOST_DSI_TCCR4_LPWR_TOCNT    (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR4_LPWR_TOCNT_0  (0x1U<<0U)

// DSI_TCCR5 Configuration

#define DSIHOST_DSI_TCCR5_BTA_TOCNT     (0xFFFFU<<0U)
#define DSIHOST_DSI_TCCR5_BTA_TOCNT_0   (0x1U<<0U)

// DSI_CLCR Configuration

#define DSIHOST_DSI_CLCR_ACR            (0x1U<<1U)
#define DSIHOST_DSI_CLCR_DPCC           (0x1U<<0U)

// DSI_CLTCR Configuration

#define DSIHOST_DSI_CLTCR_HS2LP_TIME    (0x3FFU<<16U)
#define DSIHOST_DSI_CLTCR_HS2LP_TIME_0  (0x1U<<16U)
#define DSIHOST_DSI_CLTCR_LP2HS_TIME    (0x3FFU<<0U)
#define DSIHOST_DSI_CLTCR_LP2HS_TIME_0  (0x1U<<0U)

// DSI_DLTCR Configuration

#define DSIHOST_DSI_DLTCR_HS2LP_TIME    (0xFFU<<24U)
#define DSIHOST_DSI_DLTCR_HS2LP_TIME_0  (0x1U<<24U)
#define DSIHOST_DSI_DLTCR_LP2HS_TIME    (0xFFU<<16U)
#define DSIHOST_DSI_DLTCR_LP2HS_TIME_0  (0x1U<<16U)
#define DSIHOST_DSI_DLTCR_MRD_TIME      (0x7FFFU<<0U)
#define DSIHOST_DSI_DLTCR_MRD_TIME_0    (0x1U<<0U)

// DSI_PCTLR Configuration

#define DSIHOST_DSI_PCTLR_CKE           (0x1U<<2U)
#define DSIHOST_DSI_PCTLR_DEN           (0x1U<<1U)

// DSI_PCONFR Configuration

#define DSIHOST_DSI_PCONFR_SW_TIME      (0xFFU<<8U)
#define DSIHOST_DSI_PCONFR_SW_TIME_0    (0x1U<<8U)
#define DSIHOST_DSI_PCONFR_NL           (0x3U<<0U)
#define DSIHOST_DSI_PCONFR_NL_0         (0x1U<<0U)

// DSI_PUCR Configuration

#define DSIHOST_DSI_PUCR_UEDL           (0x1U<<3U)
#define DSIHOST_DSI_PUCR_URDL           (0x1U<<2U)
#define DSIHOST_DSI_PUCR_UECL           (0x1U<<1U)
#define DSIHOST_DSI_PUCR_URCL           (0x1U<<0U)

// DSI_PTTCR Configuration

#define DSIHOST_DSI_PTTCR_TX_TRIG       (0xFU<<0U)
#define DSIHOST_DSI_PTTCR_TX_TRIG_0     (0x1U<<0U)

// DSI_PSR Configuration

#define DSIHOST_DSI_PSR_UAN1            (0x1U<<8U)
#define DSIHOST_DSI_PSR_PSS1            (0x1U<<7U)
#define DSIHOST_DSI_PSR_RUE0            (0x1U<<6U)
#define DSIHOST_DSI_PSR_UAN0            (0x1U<<5U)
#define DSIHOST_DSI_PSR_PSS0            (0x1U<<4U)
#define DSIHOST_DSI_PSR_UANC            (0x1U<<3U)
#define DSIHOST_DSI_PSR_PSSC            (0x1U<<2U)
#define DSIHOST_DSI_PSR_PD              (0x1U<<1U)

// DSI_ISR0 Configuration

#define DSIHOST_DSI_ISR0_PE4            (0x1U<<20U)
#define DSIHOST_DSI_ISR0_PE3            (0x1U<<19U)
#define DSIHOST_DSI_ISR0_PE2            (0x1U<<18U)
#define DSIHOST_DSI_ISR0_PE1            (0x1U<<17U)
#define DSIHOST_DSI_ISR0_PE0            (0x1U<<16U)
#define DSIHOST_DSI_ISR0_AE15           (0x1U<<15U)
#define DSIHOST_DSI_ISR0_AE14           (0x1U<<14U)
#define DSIHOST_DSI_ISR0_AE13           (0x1U<<13U)
#define DSIHOST_DSI_ISR0_AE12           (0x1U<<12U)
#define DSIHOST_DSI_ISR0_AE11           (0x1U<<11U)
#define DSIHOST_DSI_ISR0_AE10           (0x1U<<10U)
#define DSIHOST_DSI_ISR0_AE9            (0x1U<<9U)
#define DSIHOST_DSI_ISR0_AE8            (0x1U<<8U)
#define DSIHOST_DSI_ISR0_AE7            (0x1U<<7U)
#define DSIHOST_DSI_ISR0_AE6            (0x1U<<6U)
#define DSIHOST_DSI_ISR0_AE5            (0x1U<<5U)
#define DSIHOST_DSI_ISR0_AE4            (0x1U<<4U)
#define DSIHOST_DSI_ISR0_AE3            (0x1U<<3U)
#define DSIHOST_DSI_ISR0_AE2            (0x1U<<2U)
#define DSIHOST_DSI_ISR0_AE1            (0x1U<<1U)
#define DSIHOST_DSI_ISR0_AE0            (0x1U<<0U)

// DSI_ISR1 Configuration

#define DSIHOST_DSI_ISR1_GPRXE          (0x1U<<12U)
#define DSIHOST_DSI_ISR1_GPRDE          (0x1U<<11U)
#define DSIHOST_DSI_ISR1_GPTXE          (0x1U<<10U)
#define DSIHOST_DSI_ISR1_GPWRE          (0x1U<<9U)
#define DSIHOST_DSI_ISR1_GCWRE          (0x1U<<8U)
#define DSIHOST_DSI_ISR1_LPWRE          (0x1U<<7U)
#define DSIHOST_DSI_ISR1_EOTPE          (0x1U<<6U)
#define DSIHOST_DSI_ISR1_PSE            (0x1U<<5U)
#define DSIHOST_DSI_ISR1_CRCE           (0x1U<<4U)
#define DSIHOST_DSI_ISR1_ECCME          (0x1U<<3U)
#define DSIHOST_DSI_ISR1_ECCSE          (0x1U<<2U)
#define DSIHOST_DSI_ISR1_TOLPRX         (0x1U<<1U)
#define DSIHOST_DSI_ISR1_TOHSTX         (0x1U<<0U)

// DSI_IER0 Configuration

#define DSIHOST_DSI_IER0_PE4IE          (0x1U<<20U)
#define DSIHOST_DSI_IER0_PE3IE          (0x1U<<19U)
#define DSIHOST_DSI_IER0_PE2IE          (0x1U<<18U)
#define DSIHOST_DSI_IER0_PE1IE          (0x1U<<17U)
#define DSIHOST_DSI_IER0_PE0IE          (0x1U<<16U)
#define DSIHOST_DSI_IER0_AE15IE         (0x1U<<15U)
#define DSIHOST_DSI_IER0_AE14IE         (0x1U<<14U)
#define DSIHOST_DSI_IER0_AE13IE         (0x1U<<13U)
#define DSIHOST_DSI_IER0_AE12IE         (0x1U<<12U)
#define DSIHOST_DSI_IER0_AE11IE         (0x1U<<11U)
#define DSIHOST_DSI_IER0_AE10IE         (0x1U<<10U)
#define DSIHOST_DSI_IER0_AE9IE          (0x1U<<9U)
#define DSIHOST_DSI_IER0_AE8IE          (0x1U<<8U)
#define DSIHOST_DSI_IER0_AE7IE          (0x1U<<7U)
#define DSIHOST_DSI_IER0_AE6IE          (0x1U<<6U)
#define DSIHOST_DSI_IER0_AE5IE          (0x1U<<5U)
#define DSIHOST_DSI_IER0_AE4IE          (0x1U<<4U)
#define DSIHOST_DSI_IER0_AE3IE          (0x1U<<3U)
#define DSIHOST_DSI_IER0_AE2IE          (0x1U<<2U)
#define DSIHOST_DSI_IER0_AE1IE          (0x1U<<1U)
#define DSIHOST_DSI_IER0_AE0IE          (0x1U<<0U)

// DSI_IER1 Configuration

#define DSIHOST_DSI_IER1_GPRXEIE        (0x1U<<12U)
#define DSIHOST_DSI_IER1_GPRDEIE        (0x1U<<11U)
#define DSIHOST_DSI_IER1_GPTXEIE        (0x1U<<10U)
#define DSIHOST_DSI_IER1_GPWREIE        (0x1U<<9U)
#define DSIHOST_DSI_IER1_GCWREIE        (0x1U<<8U)
#define DSIHOST_DSI_IER1_LPWREIE        (0x1U<<7U)
#define DSIHOST_DSI_IER1_EOTPEIE        (0x1U<<6U)
#define DSIHOST_DSI_IER1_PSEIE          (0x1U<<5U)
#define DSIHOST_DSI_IER1_CRCEIE         (0x1U<<4U)
#define DSIHOST_DSI_IER1_ECCMEIE        (0x1U<<3U)
#define DSIHOST_DSI_IER1_ECCSEIE        (0x1U<<2U)
#define DSIHOST_DSI_IER1_TOLPRXIE       (0x1U<<1U)
#define DSIHOST_DSI_IER1_TOHSTXIE       (0x1U<<0U)

// DSI_FIR0 Configuration

#define DSIHOST_DSI_FIR0_FPE4           (0x1U<<20U)
#define DSIHOST_DSI_FIR0_FPE3           (0x1U<<19U)
#define DSIHOST_DSI_FIR0_FPE2           (0x1U<<18U)
#define DSIHOST_DSI_FIR0_FPE1           (0x1U<<17U)
#define DSIHOST_DSI_FIR0_FPE0           (0x1U<<16U)
#define DSIHOST_DSI_FIR0_FAE15          (0x1U<<15U)
#define DSIHOST_DSI_FIR0_FAE14          (0x1U<<14U)
#define DSIHOST_DSI_FIR0_FAE13          (0x1U<<13U)
#define DSIHOST_DSI_FIR0_FAE12          (0x1U<<12U)
#define DSIHOST_DSI_FIR0_FAE11          (0x1U<<11U)
#define DSIHOST_DSI_FIR0_FAE10          (0x1U<<10U)
#define DSIHOST_DSI_FIR0_FAE9           (0x1U<<9U)
#define DSIHOST_DSI_FIR0_FAE8           (0x1U<<8U)
#define DSIHOST_DSI_FIR0_FAE7           (0x1U<<7U)
#define DSIHOST_DSI_FIR0_FAE6           (0x1U<<6U)
#define DSIHOST_DSI_FIR0_FAE5           (0x1U<<5U)
#define DSIHOST_DSI_FIR0_FAE4           (0x1U<<4U)
#define DSIHOST_DSI_FIR0_FAE3           (0x1U<<3U)
#define DSIHOST_DSI_FIR0_FAE2           (0x1U<<2U)
#define DSIHOST_DSI_FIR0_FAE1           (0x1U<<1U)
#define DSIHOST_DSI_FIR0_FAE0           (0x1U<<0U)

// DSI_FIR1 Configuration

#define DSIHOST_DSI_FIR1_FGPRXE         (0x1U<<12U)
#define DSIHOST_DSI_FIR1_FGPRDE         (0x1U<<11U)
#define DSIHOST_DSI_FIR1_FGPTXE         (0x1U<<10U)
#define DSIHOST_DSI_FIR1_FGPWRE         (0x1U<<9U)
#define DSIHOST_DSI_FIR1_FGCWRE         (0x1U<<8U)
#define DSIHOST_DSI_FIR1_FLPWRE         (0x1U<<7U)
#define DSIHOST_DSI_FIR1_FEOTPE         (0x1U<<6U)
#define DSIHOST_DSI_FIR1_FPSE           (0x1U<<5U)
#define DSIHOST_DSI_FIR1_FCRCE          (0x1U<<4U)
#define DSIHOST_DSI_FIR1_FECCME         (0x1U<<3U)
#define DSIHOST_DSI_FIR1_FECCSE         (0x1U<<2U)
#define DSIHOST_DSI_FIR1_FTOLPRX        (0x1U<<1U)
#define DSIHOST_DSI_FIR1_FTOHSTX        (0x1U<<0U)

// DSI_VSCR Configuration

#define DSIHOST_DSI_VSCR_UR             (0x1U<<8U)
#define DSIHOST_DSI_VSCR_EN             (0x1U<<0U)

// DSI_LCVCIDR Configuration

